service/person/person.impl/src/test/resources/testRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 

xmlns:v1="http://www.example.org/PersonService/v1">
<!-- URL = http://localhost:8080/ws -->
 <soapenv:Header/>

   <soapenv:Body>

     <v1:findPerson>
        <v1:firstName>Bob</v1:firstName>
        <v1:surname>Hoskins</v1:surname>
     </v1:findPerson>
   </soapenv:Body>

</soapenv:Envelope>